УправлениеПлатформеннымиОбработками/src/Catalogs/ВерсииПлатформенныхОбработок/ВерсииПлатформенныхОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииПлатформенныхОбработок</name>
  <basedOn>Catalog.ВерсииПлатформенныхОбработок</basedOn>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ПлатформенныеОбработки</owners>
  <attributes>
    <name>ДанныеВерсии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПлатформеннымиОбработками/src/Catalogs/ВерсииПлатформенныхОбработок/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработка заполнения.
// 
// Параметры:
//  ДанныеЗаполнения - СправочникСсылка.ВерсииПлатформенныхОбработок
//  ТекстЗаполнения - Строка, Неопределено - Текст заполнения
//  СтандартнаяОбработка - Булево - Стандартная обработка
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВерсииПлатформенныхОбработок") Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ДанныеЗаполнения;
	
	РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Родитель, "Владелец,ВерсияПриложения,Родитель,ДанныеВерсии,КлючевоеИмя");
		
	Если ЗначениеЗаполнено(РеквизитыРодителя.Родитель) Тогда
		Родитель = РеквизитыРодителя.Родитель;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыРодителя, "ДанныеВерсии,Владелец,ВерсияПриложения,КлючевоеИмя");
	
	Наименование = СтрШаблон("%1 (исправленная версия %2)", РеквизитыРодителя.Владелец, ВерсияПриложения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
